In [1]:
import psycopg2
import sys
import pandas as pd
import pandas.io.sql as sqlio

# Download

In [1]:
def download_table(tb_name):
    print('Downloading {} ...'.format(tb_name))
    sql = "select * from clean.{};".format(tb_name)
    return sqlio.read_sql_query(sql, conn)

In [10]:
#Define our connection string
conn_string = "host='localhost' dbname='o1_database' user='cchallu' password='XXX' port='8888'"

# print the connection string we will use to connect
print("Connecting to database\n	{0}".format(conn_string))

# get a connection, if a connect cannot be made an exception will be raised here
conn = psycopg2.connect(conn_string)

# conn.cursor will return a cursor object, you can use this cursor to perform queries
cursor = conn.cursor()
print("Connected!\n")

Connecting to database
	host='localhost' dbname='o1_database' user='cchallu' password='chance syndrome smoked empathy catacomb outsell' port='8888'
Connected!

In [11]:
cursor.execute("""SELECT table_name FROM information_schema.tables
       WHERE table_schema = 'clean'""")
tables = []
for table in cursor.fetchall():
    tables.append(table[0])
tables

['all_student_lookups',
 'all_grades',
 'all_absences',
 'all_snapshots',
 'high_school_gpa',
 'intervention',
 'oaaogt']

In [12]:
# Takes some time
all_student_lookups = download_table(tables[0])
all_grades = download_table(tables[1])
all_absences = download_table(tables[2])
all_snapshots = download_table(tables[3])
high_school_gpa = download_table(tables[4])
intervention = download_table(tables[5])
oaaogt = download_table(tables[6])

Downloading all_student_lookups ...
Downloading all_grades ...
Downloading all_absences ...
Downloading all_snapshots ...
Downloading high_school_gpa ...
Downloading intervention ...
Downloading oaaogt ...

# Columns, heads, shapes, value_counts

## Student lookups

In [14]:
print('Number of students: ', len(all_student_lookups))
all_student_lookups.head()

Number of students:  61346

   student_lookup
0             1.0
1             2.0
2             3.0
3             4.0
4             5.0

## Grades

In [17]:
all_grades.shape

(5126624, 11)

In [21]:
all_grades.columns

Index(['student_lookup', 'course_code', 'course_name', 'grade', 'mark',
       'school_year', 'term', 'term_type', 'district', 'clean_term',
       'percent_of_year'],
      dtype='object')

In [22]:
all_grades.head()

,student_lookup,course_code,course_name,grade,mark,school_year,term,term_type,district,clean_term,percent_of_year
0,1,ART2,CON ART 2ND GRADE,2.0,S,2014,Final Year End,None,River,final,0.00
1,1,ART2,CON ART 2ND GRADE,2.0,S,2014,Quarter 2,None,River,quarter 2,0.25
2,1,ART2,CON ART 2ND GRADE,2.0,S,2014,Quarter 4,None,River,quarter 4,0.25
3,1,ART3,CON ART 3RD GRADE,3.0,O,2015,Final Year End,None,River,final,0.00
4,1,ART3,CON ART 3RD GRADE,3.0,O,2015,Quarter 2,None,River,quarter 2,0.25

In [29]:
all_grades.student_lookup.nunique()

41551

In [26]:
all_grades.course_name.unique()

array(['CON ART 2ND GRADE', 'CON ART 3RD GRADE', 'CON ART KDG', ...,
       'French', '1st Grade Language Arts', 'SC-English 11 (1/4 credit)'],
      dtype=object)

In [27]:
all_grades.course_name.nunique()

7253

In [65]:
all_grades.grade.value_counts(dropna=False)

 9.0     548475
 10.0    512959
 8.0     504490
 7.0     496180
 6.0     381792
 5.0     355875
 11.0    355843
 4.0     351827
 3.0     342364
 12.0    298699
 NaN     283832
 2.0     256903
 1.0     245085
 0.0     191140
 23.0      1149
-1.0         11
Name: grade, dtype: int64

In [66]:
all_grades.mark.value_counts(dropna=False)

A        1475964
B         655533
S         428869
C         372261
A-        273660
          ...
58.38          1
6.25           1
52.54          1
57.68          1
55.41          1
Name: mark, Length: 5303, dtype: int64

## Absences

In [19]:
all_absences.shape

(1353739, 14)

In [20]:
all_absences.head()

,student_lookup,absence_code,absence_desc,absence_length,date,school,month,week,weekday,grade,absence_starting_date,absence_consec_count,tardy_starting_date,tardy_consec_count
0,18162,E,court,1,2015-04-28,None,4,18,2,9.0,None,NaN,None,NaN
1,18220,E,court,0.5,2015-08-25,None,8,35,2,10.0,None,NaN,None,NaN
2,18491,M,medical,None,2015-01-13,None,1,3,2,3.0,None,NaN,None,NaN
3,18912,M,medical,None,2015-03-09,None,3,11,1,3.0,None,NaN,None,NaN
4,19036,M,medical,None,2014-10-22,None,10,43,3,11.0,None,NaN,None,NaN

In [30]:
all_absences.absence_desc.unique()

array(['court', 'medical', 'misc', 'early_dismiss', 'tardy_unexcused',
       'absence_excused', 'absence_all_day', 'absence_unexcused', 'jdc',
       'testing', 'missing_desc', 'CANNOT_FIND_CHECK_VALUES',
       'college_day', 'alternative_school', 'tardy_excused', 'left_early',
       'field_trip', 'pm_absent', 'early_dismiss_approved',
       'suspension_in_school', 'mat_child', 'med_legal_am',
       'med_legal_pm', 'suspension', 'med_legal_all_day', 'tardy_medical',
       'suspension_educated', 'school_transport_issue',
       'not_counted_absent', 'arrive_late_not_tardy', 'am_absent',
       'suspension_out_school', 'departed_will_return', 'religious',
       'home_instruction', 'no_power', 'expulsion'], dtype=object)

## Snapshots

In [31]:
all_snapshots.shape

(259946, 36)

In [33]:
all_snapshots.columns

Index(['student_lookup', 'district', 'school_code', 'grade', 'school_year',
       'birth_date', 'city', 'days_absent', 'days_absent_excused',
       'days_absent_unexcused', 'days_present', 'diploma_type', 'disability',
       'disadvantagement', 'discipline_incidents', 'district_admit_date',
       'district_withdraw_date', 'ethnicity', 'gender', 'gifted',
       'graduation_date', 'iss', 'limited_english', 'oss', 'school_name',
       'section_504_plan', 'special_ed', 'state', 'street', 'street2',
       'withdraw_reason', 'withdrawn_to_irn', 'zip', 'status', 'street_clean',
       'id'],
      dtype='object')

In [34]:
all_snapshots.head()

,student_lookup,district,school_code,grade,school_year,birth_date,city,days_absent,days_absent_excused,days_absent_unexcused,...,special_ed,state,street,street2,withdraw_reason,withdrawn_to_irn,zip,status,street_clean,id
0,46.0,TriValley,TVHS,12.0,2014,1996-12-01,dresden,81.5,7.0,74.5,...,None,OH,11955 Bottom Rd,None,did not withdraw,None,43821-9423,active,11955 Bottom Rd,2557
1,57.0,Franklin,FDFP,2.0,2006,1999-01-01,zanesville,0.0,NaN,NaN,...,100,OH,1060 Bam Ln,None,None,None,43701-7611,active,1060 Bam Ln,2614
2,72.0,Maysville,MAES,2.0,2006,1998-08-01,roseville,NaN,NaN,NaN,...,100,OH,5135 Lambert Rd,None,None,None,43777-9718,active,5135 Lambert Rd,2676
3,95.0,Zanesville,None,6.0,2012,2001-01-01,None,NaN,NaN,NaN,...,None,None,None,None,None,None,None,open_enrollment,None,2812
4,112.0,TriValley,TVEF,0.0,2006,2001-01-01,frazeyburg,2.0,NaN,NaN,...,None,OH,11 3RD STREET,None,None,None,43822-9346,active,11 3Rd Street,242392

In [35]:
all_snapshots.student_lookup.nunique()

59850

In [47]:
all_snapshots.withdraw_reason.value_counts(dropna=False)

did not withdraw                   127454
NaN                                 99239
transferred - in state              16256
graduate                            11918
transferred - out of state           1975
withdrew - PS                        1175
transferred - homeschool              430
dropout - over 18                     352
transferred - private                 349
transferred - out of country          175
error                                 141
dropout - did not finish tests        113
withdrew - KG                          75
dropout - attendance                   74
expelled                               70
dropout - moved                        57
withdrew - death                       35
transferred - court ordered            30
dropout - employment                   13
withdrew - illness                      7
withdrew - must leave IRN               5
withdrew - district eligibility         3
Name: withdraw_reason, dtype: int64

In [48]:
all_snapshots.district.value_counts(dropna=False)

TriValley                35350
Maysville                26185
Franklin                 25206
Riverview                24959
Logan_Hocking            22055
Coshocton                20283
Zanesville               19635
West Muskingum           18960
East Muskingum           14642
Ridgewood                13546
Northern Local SD        11469
New Lexington City SD    10887
Morgan                    8799
Crooksville               7969
NaN                          1
Name: district, dtype: int64

In [49]:
all_snapshots.school_code.value_counts(dropna=False)

NaN     28435
MAES    12623
TVHS    11261
6        9553
3        9060
FDFP     8510
RVHS     8071
MAHS     7779
COCS     7746
FPHS     7704
8        6713
5        6336
WMHS     6147
COHI     6011
MAMS     5783
TVEJ     5752
TVEN     5461
TVMS     5434
RIHS     5349
FPJH     5170
WMED     5138
WMMS     4736
2        4735
EMHS     4470
RIJH     4126
RIWE     4071
RWAR     3862
RCON     3845
RVJH     3835
4        3758
TVEF     3484
EMMS     3300
EMIS     3217
TVEA     3105
WMEH     2939
CEEP     2920
COMI     2919
1        2902
CEHS     2864
RKEE     2676
RUNI     2632
FRMS     2552
COLS     2217
CEIS     2149
EMEN     1840
7        1326
FRPR     1270
COSL     1228
EMEP      969
TVEI      853
EMEK      846
COWS      162
RPLE       38
CEPS       36
47         28
Name: school_code, dtype: int64

In [50]:
all_snapshots.gender.value_counts(dropna=False)

M      134447
F      125482
NaN        17
Name: gender, dtype: int64

In [51]:
all_snapshots.ethnicity.value_counts(dropna=False)

W      240681
M       11274
B        4621
H        1301
A        1068
NaN       764
I         237
Name: ethnicity, dtype: int64

In [52]:
all_snapshots.gifted.value_counts(dropna=False)

NaN    235650
Y       13381
N       10906
0           7
L           2
Name: gifted, dtype: int64

In [64]:
all_snapshots.grade.value_counts(dropna=False)

 9.0     20269
 10.0    19842
 12.0    19816
 8.0     19618
 7.0     19462
 11.0    19216
 6.0     19060
 5.0     18943
 3.0     18914
 1.0     18884
 2.0     18870
 4.0     18823
 0.0     18633
-1.0      8401
 23.0      665
 NaN       301
 99.0      229
Name: grade, dtype: int64

In [53]:
all_snapshots.sort_values(['student_lookup', 'school_year'])

,student_lookup,district,school_code,grade,school_year,birth_date,city,days_absent,days_absent_excused,days_absent_unexcused,...,special_ed,state,street,street2,withdraw_reason,withdrawn_to_irn,zip,status,street_clean,id
1742,1.0,Riverview,RCON,0.0,2012,2007-01-01,coshocton,16.00,16.0,0.0,...,None,OH,20835 Sr 16,None,did not withdraw,None,43812,active,20835 Sr 16,2451
1743,1.0,Riverview,RCON,1.0,2013,2007-01-01,coshocton,3.00,3.0,0.0,...,None,OH,20835 Sr 16,None,did not withdraw,None,43812,active,20835 Sr 16,2448
1744,1.0,Riverview,RCON,3.0,2014,2007-01-01,coshocton,14.00,14.0,0.0,...,None,OH,20835 Sr 16,None,did not withdraw,None,43812,active,20835 Sr 16,2450
1745,1.0,Riverview,RCON,3.0,2015,2007-01-01,coshocton,5.50,5.5,0.0,...,None,OH,20835 Sr 16,None,did not withdraw,None,43812,active,20835 Sr 16,2449
1746,2.0,Maysville,MAES,3.0,2015,2007-01-01,east fultonham,16.00,13.0,3.0,...,None,OH,5785 Ream Ave,None,transferred - in state,None,43735,inactive,5785 Ream Ave,2452
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
259942,701184.0,New Lexington City SD,1,12.0,2011,1993-12-01,pataskala,0.00,NaN,NaN,...,None,OH,723 Ridgeview Drive,None,None,None,43062,6,723 Ridgeview Dr,260798
259943,701185.0,Northern Local SD,2,0.0,2011,2006-03-01,mount perry,NaN,NaN,NaN,...,None,OH,9710 Wesley Chapel Rd,None,None,None,43760,6,9710 Wesley Chapel Rd,161584
259944,701186.0,New Lexington City SD,1,23.0,2011,1993-04-01,nelsonville,0.00,NaN,NaN,...,None,OH,174 Mound Street,None,None,None,45764,7,174 Mound Street,161586
259945,701187.0,New Lexington City SD,4,8.0,2011,1998-05-01,junction city,9.55,NaN,NaN,...,None,OH,4201 Mainesville Road,None,None,None,43748,7,4201 Mainesville Rd,254774
1764,NaN,None,None,NaN,2012,None,None,NaN,NaN,NaN,...,None,None,None,None,None,None,None,None,None,1305

## High school GPA

In [54]:
high_school_gpa.shape

(51093, 4)

In [55]:
high_school_gpa.columns

Index(['student_lookup', 'school_year', 'gpa', 'num_classes'], dtype='object')

In [56]:
high_school_gpa.head()

   student_lookup  school_year       gpa  num_classes
0              45         2013  3.333333           24
1              45         2014  3.409091           22
2              45         2015  3.041667           24
3              46         2011  1.648387           31
4              46         2012  1.370000           20

In [57]:
high_school_gpa.student_lookup.nunique()

21935

## Interventions

In [58]:
intervention.shape

(158239, 9)

In [59]:
intervention.columns

Index(['student_lookup', 'status', 'gender', 'membership_code', 'description',
       'school_year', 'district', 'grade', 'inv_group'],
      dtype='object')

In [60]:
intervention.head()

,student_lookup,status,gender,membership_code,description,school_year,district,grade,inv_group
0,9739,A,M,152330,Student received intervention provided during ...,2007,Franklin,3.0,academic_inv
1,11230,A,M,152330,Student received intervention provided during ...,2007,Franklin,3.0,academic_inv
2,1969,A,F,152330,Student received intervention provided during ...,2007,Franklin,3.0,academic_inv
3,68943,I,M,210014,21-60% SPEC ED,2006,Franklin,5.0,placement
4,10466,A,M,210013,<21% SPEC ED,2007,Franklin,3.0,placement

In [61]:
intervention.description.value_counts(dropna=False)

Student received intervention provided during regular school    27453
Speech & Language Services                                      10932
Track and Field                                                  8474
Football                                                         7954
Basketball                                                       6833
                                                                ...
School Health Services                                              3
Previously reported as a dropout in another Ohio district           1
Special Education Program - Separate School                         1
All Special Ed in separate school                                   1
Early childhood special education setting                           1
Name: description, Length: 150, dtype: int64

In [62]:
intervention.student_lookup.nunique()

27635

## Test scores

In [67]:
oaaogt.shape

(48052, 62)

In [68]:
oaaogt.student_lookup.nunique()

46419

In [69]:
oaaogt.columns

Index(['student_lookup', 'dob', 'gender', 'ethnicity', 'kral', 'kral_pl',
       'third_read_pl', 'third_read_ss', 'third_math_pl', 'third_math_ss',
       'fourth_read_pl', 'fourth_read_ss', 'fourth_math_pl', 'fourth_math_ss',
       'fourth_write_pl', 'fourth_write_ss', 'fourth_ctz_pl', 'fourth_ctz_ss',
       'fourth_science_pl', 'fourth_science_ss', 'fifth_read_pl',
       'fifth_read_ss', 'fifth_math_pl', 'fifth_math_ss',
       'fifth_socstudies_pl', 'fifth_socstudies_ss', 'fifth_science_pl',
       'fifth_science_ss', 'sixth_read_pl', 'sixth_read_ss', 'sixth_math_pl',
       'sixth_math_ss', 'sixth_write_pl', 'sixth_write_ss', 'sixth_ctz_pl',
       'sixth_ctz_ss', 'sixth_science_pl', 'sixth_science_ss',
       'seventh_read_pl', 'seventh_read_ss', 'seventh_math_pl',
       'seventh_math_ss', 'seventh_write_pl', 'seventh_write_ss',
       'eighth_read_pl', 'eighth_read_ss', 'eighth_math_pl', 'eighth_math_ss',
       'eighth_science_pl', 'eighth_science_ss', 'eighth_socstudies_pl',
       'eighth_socstudies_ss', 'ogt_read_pl', 'ogt_read_ss', 'ogt_math_pl',
       'ogt_math_ss', 'ogt_write_pl', 'ogt_write_ss', 'ogt_science_pl',
       'ogt_science_ss', 'ogt_socstudies_pl', 'ogt_socstudies_ss'],
      dtype='object')

In [71]:
oaaogt.head()

,student_lookup,dob,gender,ethnicity,kral,kral_pl,third_read_pl,third_read_ss,third_math_pl,third_math_ss,...,ogt_read_pl,ogt_read_ss,ogt_math_pl,ogt_math_ss,ogt_write_pl,ogt_write_ss,ogt_science_pl,ogt_science_ss,ogt_socstudies_pl,ogt_socstudies_ss
0,30015,2006-12-01,None,None,11.0,Intense,None,None,None,None,...,None,None,None,None,None,None,None,None,None,None
1,7520,2006-12-01,None,None,29.0,Enriched,None,None,None,None,...,None,None,None,None,None,None,None,None,None,None
2,48681,2007-08-01,None,None,NaN,None,None,None,None,None,...,None,None,None,None,None,None,None,None,None,None
3,62503,1995-04-01,None,None,NaN,None,Basic,386,None,None,...,None,None,None,None,None,None,None,None,None,None
4,59606,None,None,None,NaN,None,Proficient,412,None,None,...,None,None,None,None,None,None,None,None,None,None